## Basic SQL

This Notebook contains the basic SQL queries Exercise of the Udacity SQL course

### Connecting to the SQLite db file

In [1]:
# Importing library
import sqlite3

# Connect to or create the SQLite database

conn = sqlite3.connect('parch_and_posey.db')

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///parch_and_posey.db

In [4]:
%%sql

SELECT name FROM sqlite_master WHERE type IN ('table','view') AND name NOT LIKE 'sqlite_%' ORDER BY 1

 * sqlite:///parch_and_posey.db
Done.

[('accounts',), ('orders',), ('region',), ('sales_reps',), ('web_events',)]

<br>

### ORDER BY

**Write a query to return the 10 earliest orders in the orders table. Include the `id`, `occurred_at`, and `total_amt_usd`.**

In [5]:
%%sql

SELECT id, occurred_at, total_amt_usd
FROM orders
ORDER BY occurred_at DESC
LIMIT 10;

 * sqlite:///parch_and_posey.db
Done.

[(6451, '2017-01-02 00:02:40', 6451.76),
 (3546, '2017-01-01 23:50:16', 1932.85),
 (6454, '2017-01-01 22:29:50', 1854.57),
 (3554, '2017-01-01 22:17:26', 2666.79),
 (6556, '2017-01-01 21:04:25', 892.85),
 (3745, '2017-01-01 20:52:23', 2582.4),
 (1092, '2017-01-01 17:34:10', 1525.98),
 (1364, '2017-01-01 16:40:57', 1036.57),
 (3159, '2017-01-01 14:05:39', 1870.35),
 (6223, '2017-01-01 13:57:21', 4676.25)]

**Write a query to return the top 5 orders in terms of largest `total_amt_usd`. Include the `id`, `account_id`, and `total_amt_usd`.**

In [6]:
%%sql

SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY total_amt_usd DESC
LIMIT 5;

 * sqlite:///parch_and_posey.db
Done.

[(4016, 4251, 232207.07),
 (3892, 4161, 112875.18),
 (3963, 4211, 107533.55),
 (5791, 2861, 95005.82),
 (3778, 4101, 93547.84)]

**Write a query to return the lowest 20 orders in terms of smallest `total_amt_usd`. Include the `id`, `account_id`, and `total_amt_usd`.**

In [7]:
%%sql

SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY total_amt_usd
LIMIT 20;

 * sqlite:///parch_and_posey.db
Done.

[(124, 1131, 0.0),
 (1353, 1951, 0.0),
 (2518, 2881, 0.0),
 (4445, 1221, 0.0),
 (4446, 1231, 0.0),
 (4490, 1281, 0.0),
 (4625, 1411, 0.0),
 (4770, 1521, 0.0),
 (4844, 1571, 0.0),
 (5001, 1791, 0.0),
 (5057, 1851, 0.0),
 (5612, 2601, 0.0),
 (6009, 3141, 0.0),
 (6281, 3491, 0.0),
 (6312, 3541, 0.0),
 (6323, 3551, 0.0),
 (6375, 3651, 0.0),
 (6435, 3801, 0.0),
 (6523, 3991, 0.0),
 (6856, 4451, 0.0)]

<br>

**Write a query that displays the order ID, account ID, and total dollar amount for all the orders, sorted first by the account ID (in ascending order), and then by the total dollar amount (in descending order).**

In [8]:
%%sql

SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY account_id, total_amt_usd DESC
LIMIT 20

 * sqlite:///parch_and_posey.db
Done.

[(4308, 1001, 9426.71),
 (4309, 1001, 9230.67),
 (4316, 1001, 9134.31),
 (4317, 1001, 8963.91),
 (4314, 1001, 8863.24),
 (4307, 1001, 8757.18),
 (4311, 1001, 8672.95),
 (4310, 1001, 8538.26),
 (4312, 1001, 8343.09),
 (4313, 1001, 8311.59),
 (4315, 1001, 8286.99),
 (4318, 1001, 7924.46),
 (8, 1001, 2052.2),
 (14, 1001, 1993.58),
 (16, 1001, 1719.28),
 (2, 1001, 1718.03),
 (7, 1001, 1498.2),
 (15, 1001, 1283.12),
 (12, 1001, 1182.61),
 (6, 1001, 1067.25)]

<br>

**Now write a query that again displays order ID, account ID, and total dollar amount for each order, but this time sorted first by total dollar amount (in descending order), and then by account ID (in ascending order).**

In [9]:
%%sql

SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY total_amt_usd DESC, account_id
LIMIT 25;

 * sqlite:///parch_and_posey.db
Done.

[(4016, 4251, 232207.07),
 (3892, 4161, 112875.18),
 (3963, 4211, 107533.55),
 (5791, 2861, 95005.82),
 (3778, 4101, 93547.84),
 (6590, 4111, 93505.69),
 (362, 1301, 93106.81),
 (731, 1521, 92991.05),
 (4562, 1341, 84099.62),
 (3858, 4151, 82163.71),
 (4942, 1701, 81243.96),
 (1191, 1831, 77285.75),
 (1913, 2461, 48675.9),
 (5479, 2441, 45465.23),
 (4698, 1451, 43421.28),
 (5167, 2041, 40928.7),
 (4230, 4451, 36123.87),
 (1939, 2461, 34016.55),
 (6442, 3811, 31873.12),
 (4806, 1541, 31329.24),
 (1245, 1871, 30541.97),
 (1112, 1781, 30279.45),
 (320, 1281, 29699.28),
 (5478, 2441, 29255.8),
 (6579, 4111, 28229.14)]

<br>

### WHERE

<br>

**Pull the first 5 rows and all columns from the orders table that have a dollar amount of `gloss_amt_usd` greater `than` or equal to `1000`.**

In [10]:
%%sql

SELECT *
FROM orders
WHERE gloss_amt_usd >= 1000
LIMIT 5;

 * sqlite:///parch_and_posey.db
Done.

[(14, 1001, '2016-10-26 20:31:30', 97, 143, 54, 294, 484.03, 1071.07, 438.48, 1993.58),
 (62, 1091, '2014-10-13 12:12:55', 146, 196, 3, 345, 728.54, 1468.04, 24.36, 2220.94),
 (88, 1101, '2015-06-24 13:08:15', 182, 339, 17, 538, 908.18, 2539.11, 138.04, 3585.33),
 (121, 1131, '2016-08-10 23:47:41', 273, 134, 0, 407, 1362.27, 1003.66, 0.0, 2365.93),
 (129, 1141, '2016-12-21 15:52:58', 143, 1045, 2157, 3345, 713.57, 7827.05, 17514.84, 26055.46)]

<br>

**Pull the first 10 rows and all columns from the orders table that have a total_amt_usd less than 500.**

In [11]:
%%sql

SELECT *
FROM orders
WHERE total_amt_usd < 500
LIMIT 10;

 * sqlite:///parch_and_posey.db
Done.

[(67, 1091, '2015-04-07 13:29:20', 95, 0, 0, 95, 474.05, 0.0, 0.0, 474.05),
 (96, 1101, '2016-03-15 11:36:03', 14, 8, 16, 38, 69.86, 59.92, 129.92, 259.7),
 (119, 1131, '2016-06-12 12:29:45', 0, 30, 23, 53, 0.0, 224.7, 186.76, 411.46),
 (124, 1131, '2016-11-07 05:10:56', 0, 0, 0, 0, 0.0, 0.0, 0.0, 0.0),
 (254, 1251, '2014-11-01 02:15:24', 0, 0, 17, 17, 0.0, 0.0, 138.04, 138.04),
 (328, 1291, '2015-08-03 08:35:23', 0, 19, 21, 40, 0.0, 142.31, 170.52, 312.83),
 (542, 1421, '2015-11-13 09:07:09', 0, 64, 0, 64, 0.0, 479.36, 0.0, 479.36),
 (683, 1501, '2016-04-14 23:59:50', 0, 15, 16, 31, 0.0, 112.35, 129.92, 242.27),
 (713, 1521, '2014-11-23 16:04:03', 0, 8, 10, 18, 0.0, 59.92, 81.2, 141.12),
 (730, 1521, '2016-05-06 02:34:48', 0, 0, 2, 2, 0.0, 0.0, 16.24, 16.24)]

<br>

### Where with Non-Numeric


**Filter the accounts table to include the company name, website, and the primary point of contact (`primary_poc`) just for the Exxon Mobil company in the accounts table.**

In [12]:
%%sql

SELECT name, website, primary_poc
FROM accounts
WHERE LOWER(name) = 'exxon mobil'

 * sqlite:///parch_and_posey.db
Done.

[('Exxon Mobil', 'www.exxonmobil.com', 'Sung Shields')]

<br>

### Arithmetic Operations

**Using the orders table:**

<br>

**Create a column that divides the standard_amt_usd by the standard_qty to find the unit price for standard paper for each order. Limit the results to the first 10 orders, and include the id and account_id fields.**

In [13]:
%%sql

SELECT id, account_id, standard_amt_usd, standard_qty, round((Standard_amt_usd/standard_qty+0.01),4) AS standard_paper_unit_price
FROM orders
LIMIT 10;

 * sqlite:///parch_and_posey.db
Done.

[(1, 1001, 613.77, 123, 5.0),
 (2, 1001, 948.1, 190, 5.0),
 (3, 1001, 424.15, 85, 5.0),
 (4, 1001, 718.56, 144, 5.0),
 (5, 1001, 538.92, 108, 5.0),
 (6, 1001, 513.97, 103, 5.0),
 (7, 1001, 503.99, 101, 5.0),
 (8, 1001, 474.05, 95, 5.0),
 (9, 1001, 454.09, 91, 5.0),
 (10, 1001, 469.06, 94, 5.0)]

<br>

**Write a query that finds the percentage of revenue that comes from poster paper for each order. You will need to use only the columns that end with `_usd`. (Try to do this without using the `total` column.) Display the `id` and `account_id` fields also.**

In [ ]:
%%sql

SELECT id, account_id,

<br>

### LIKE

<br>

**Use the accounts table to find**

**All the companies whose names start with 'C'.**

In [ ]:
%%sql

SELECT *
FROM accounts
WHERE UPPER(name) LIKE 'C%'

<br>

**All companies whose names contain the string 'one' somewhere in the name.**

<br>

**All companies whose names end with 's'**

<br>

### IN

**Use the accounts table to find the account name, primary_poc, and sales_rep_id for Walmart, Target, and Nordstrom.**

<br>

**Use the web_events table to find all information regarding individuals who were contacted via the channel of organic or adwords.**

<br>

### NOT

**Use the `accounts` table to find the account name, primary poc, and sales rep id for all stores except Walmart, Target, and Nordstrom.**

<br>

**Use the `web_events` table to find all information regarding individuals who were contacted via any method except using organic or adwords methods.**

<br>

**Use the accounts table to find:**

**All the companies whose names do not start with 'C'.**

<br>

**All companies whose names do not contain the string 'one' somewhere in the name.**

<br>

**All companies whose names do not end with 's'.**

<br>

### AND and BETWEEN

<br>

**Write a query that returns all the orders where the `standard_qty` is over `1000`, the `poster_qty` is `0`, and the `gloss_qty` is `0`.**

<br>

**Using the `accounts` table, find all the companies whose names do not start with 'C' and end with 's'.**

<br>

**When you use the BETWEEN operator in SQL, do the results include the values of your endpoints, or not? Figure out the answer to this important question by writing a query that displays the order date and `gloss_qty` data for all `orders` where gloss_qty is between 24 and 29. Then look at your output to see if the BETWEEN operator included the begin and end values or not.**

<br>

**Use the `web_events` table to find all information regarding individuals who were contacted via the `organic` or `adwords` channels, and started their account at any point in 2016, sorted from newest to oldest.**

<br>

### OR

<br>

**Find list of `orders` ids where either `gloss_qty` or `poster_qty` is greater than `4000`. Only include the id field in the resulting table.**

<br>

**Write a query that returns a list of `orders` where the `standard_qty` is zero and either the `gloss_qty` or `poster_qty` is over `1000`.**

<br>

**Find all the company names that start with a 'C' or 'W', and the primary contact `contains` 'ana' or 'Ana', but it doesn't contain 'eana'.**